{
    "posts": [
        {
            "id": 1,
            "title": "Фигма, что это такое?",
            "price": "Бесплатно",
            "description": "Онлайн-сервис для дизайнеров, веб-разработчиков и маркетологов. Он предназначен для создания прототипов сайтов или приложений, иллюстраций и векторной графики. В редакторе можно настроить совместную работу, вносить и обсуждать правки, причем как в браузере, так и через приложение на компьютере.",
            "content": [
                {
                    "article": "Введение",
                    "text": "Этот урок расскажет вам, как пользоваться фигмой, что это такое, и почему она лучше всего показывает себя в product"
                },
                {
                    "article": "Зачем это нужно?",
                    "text": "Figma – онлайн-сервис для дизайнеров, веб-разработчиков и маркетологов. Он предназначен для создания прототипов сайтов или приложений, иллюстраций и векторной графики. В редакторе можно настроить совместную работу, вносить и обсуждать правки, причем как в браузере, так и через приложение на компьютере.",
                    "blocks": [
                        {
                            "title": "Возможности и особенности Figma",
                            "text": "Хотелось бы сначала отметить ключевые моменты, благодаря которым Фигма набрала столь огромную популярность.",
                            "list": [
                                "Бесплатные функции. Можно свободно пользоваться данным графическим редактором, но только с некоторыми ограничениями. В их число входит число редакторов и проектов, время хранения истории версий и другие важные мелочи. ",
                                "Встроенные компоненты. Если вы создаете сразу несколько элементов с одинаковым стилем, можно менять их во всем макете. В других графических редакторах вам пришлось бы работать с каждым элементом по отдельности." 
                            ]
                        },
                        {
                            "text": "Если тех возможностей, что даются бесплатно, для вас недостаточно, то можно купить подписку. Описание тарифов ниже. ",
                            "img": "test.jpg"
                        }
                    ]
                },
                {
                    "article": "Как пользоваться Figma?",
                    "text": "Разберу, как пользоваться Фигмой. Сначала речь пойдет о входе в аккаунт. Я покажу, как это сделать в браузере.",
                    "blocks": [
                        {
                            "title": "Регистрация или авторизация",
                            "text": "Если вы не зарегистрированы в данном сервисе, сперва нажмите на крайнюю кнопку «Sign up», введите электронную почту, придумайте пароль и жмите на кнопку «Create account». Можно также войти через сервисы Google."
                        },
                        {
                            "text": "Я выбрала Google и авторизовалась через свой аккаунт. Следующий этап – ввод имени и выбор сферы. Также можно кликнуть по галочке для подписки на рассылку, далее  нажимаем по кнопке для создания аккаунта.                            "
                        },
                        {
                            "text": "Уже зарегистрированным пользователям необходимо кликнуть по ссылке «Log in». В результате откроется немного другое поле, где вы сможете ввести данные и авторизоваться. "
                        }
                    ]
                }
            ]
        }, 
        {
            "id": 2,
            "title": "Как разработать дизайн и код персонального веб-сайта",
            "description": "Многие разработчики считают, что быть хорошим дизайнером — это врожденная способность, что творческий подход — это то, с чем вы сразу родились. На самом деле, дизайн — это навык, который можно освоить, как и любой другой. Для создания красивого сайта не обязательно родиться художником, нужно только попрактиковаться, хорошо так попрактиковаться. Эта статья расскажет о том, как практиковать дизайн через процесс создания персонального сайта с нуля и превращения его в код.",
            "price": "Бесплатно",
            "content": [
                {
                    "article": "Зачем проектировать самостоятельно?",
                    "text": "Зачем проектировать сайт самостоятельно, если можно использовать библиотеку пользовательского интерфейса, такую как Bootstrap или ещё лучше готовый шаблон? Ниже приведены некоторые из преимуществ самостоятельного дизайна вашего сайта.",
                    "blocks": [
                        {
                            "list": [
                                "Многие блоги разработчиков используют похожие шаблоны, и легко заметить, что это не пользовательский, не авторский дизайн. Если цель личного сайта — продемонстрировать свои возможности, то использование шаблона может отвлечь внимание от этой цели и испортить впечатление.",
                                "Разработка поможет вам применить на практике алгоритмы, принципы разработки, инструменты, HTML и CSS. Вам будет удобнее разрабатывать пользовательские интерфейсы и выводить их в Интернет.",
                                "Ваши веб-сайты будут легковесными и будут лучше работать с пользовательскими CSS. Если вам нужно включить библиотеку пользовательского интерфейса или шаблон, он может содержать большое количество кода, охватывающего различные возможные настройки, которые вы не используете. Если неиспользованный код будет отправлен пользователю, это негативно скажется на производительности вашего сайта.",
                                "В роли веб-разработчика вам, возможно, не придется реализовывать весь дизайн сайта с нуля, но вы должны быть в состоянии сделать достойный внешний вид интерфейса, который соответствует существующим дизайнам. Быть «полнофункциональным разработчиком» часто означает владеть внутренним языком или фреймворком JavaScript, одновременно имея возможность работать с дизайном, HTML и CSS. В итоге, работа выполняется, но результат может не быть эстетически привлекательным, и может быть несовместимым с остальными приложениями или быть недоступным на некоторых устройствах. Полнофункциональные разработчики должны обладать некоторыми базовыми знаниями в области проектирования и суметь обучить пользователя.",
                                "Создание того, чем вы гордитесь, — это полезный опыт. Это доставит удовольствие, если вы найдете достаточно времени для практики. Вам не обязательно быть художником, чтобы получать от этого удовлетворение."
                            ],
                            "text": "Чтобы приступить к разработке своего сайта, выполните поэтапные шаги. Трудно визуализировать дизайн из редактора кода, поэтому сначала я рекомендую работать в визуальном инструменте дизайна, а затем переводить полученный результат в код. Сначала легче сосредоточиться на дизайне, чтобы вы могли видеть его и вносить коррективы, без необходимости переписывания кода."
                        }
                    ]
                }, 
                {
                    "article": "Создание каркаса модели", 
                    "text": "Первый шаг — создание приблизительного каркаса сайта. Создание каркаса помогает определить структуру страницы до добавления визуального дизайна и контента.",
                    "blocks": [
                        {
                            "title": "Структура веб-сайта",
                            "text": "Элементы, которые вы добавлять в каркас, зависят от вас. Вы можете добавить панель навигации, заголовок, записи в блоге и нижний колонтитул. Для начала, возможно, вам не."
                        },
                        {
                            "text": "Каркас не обязательно должен быть идеальным. Как только структура вашего сайта будет вас устраивать, вы сможете перейти к визуальному дизайну."
                        }
                    ]
                },
                {
                    "article": "Применяйте визуальный дизайн",
                    "text": "Для начала создайте пустое полотно, на котором будет представлена пустая страница браузера. Добавляйте свой каркас в инструмент разработки, создавая контейнеры для вашего содержимого. Я рекомендую сначала начать с черно-белых вдное пространство.",
                    "blocks": [
                        {
                            "title": "Добавление разделов и содержимого хранилища",
                            "text": "После того, как вы сделаете его похожим на веб-сайт, сделайте его красивее. Имитируйте стили других веб-сайтов, выясняя, за счет чего элементы выглядят привлекательными."
                        },
                        {
                            "text": "На данном этапе рассмотрим форму, размер, границы и тени. Постепенно обновляйте основные прямоугольники до нужного вам стиля"
                        }
                    ]
                }
            ]
        },
        {
            "id": 3,
            "title": "Что такое UX/UI дизайн на самом деле?",
            "description": "Очень много недопонимания в среде дизайнеров и разработчиков. Также много глупых вопросов, связанных с UX и UI у новичков. Часто просто из-за того, что люди не знают сути понятия",
            "price": "100р",
            "content": [
                {
                    "article": "Краткое обьяснение",
                    "text": "Нажимаете ли вы кнопки на арифмометре, крутите рукоятку точильного камня или делаете свайп по экрану смартфона — все это интерфейсы, с помощью которых вы взаимодействуете с механизмами. При этом интерфейс совсем",
                    "blocks": [
                        {
                            "text": "Цель UI/UX дизайнера — довести пользователя до какой-то логической точки в интерфейсе. Сделать так, чтобы пользователь достиг своей цели."
                        }
                    ]
                },
                {
                    "article": "Что такое UX/UI, прямым текстом",
                    "text": "(в этом разделе будут банальные фразы)",
                    "blocks": [
                        {
                            "text": "UX — это User Experience (дословно: «опыт пользователя»). То есть это то, какой опыт/впечатление получает пользователь от работы с вашим интерфейсом. Удается ли ему достичь цели и на сколько просто или сложно это сделать."

                        },
                        {
                            "text": "А UI — это User Interface (дословно «пользовательский интерфейс») — то, как выглядит интерфейс и то, какие физические характеристики приобретает. Определяет, какого цвета будет ваше «изделие», удобно ли будет человеку попадать пальцем в кнопочки, читабельным ли будет текст и тому подобное…"
                        },
                        {
                            "text": "UX/UI дизайн — это проектирование любых пользовательских интерфейсов в которых удобство использования так же важно как и внешний вид."
                        }
                    ]
                },
                {   
                    "article": "Что такое UX и UI дизайн, другими словами",
                    "text": "Прямая обязанность UX/UI дизайнера — это, например, «продать» товар или услугу через интерфейс. Именно на основе работы UX/UI дизайнера пользователь принимает решение: «Быть или не быть?» Нравится или не нравится. Купить или не купить.",
                    "blocks": [
                        {
                            "text": "UX/UI дизайн не относится только к смартфонам и веб-сайтам. Более того, профессия UX/UI дизайнера существовала с незапамятных времен. Просто раньше она так не называлась. Точнее, раньше она вообще никак не называлась, а была частью других профессий."
                        },
                        {
                            "text": "Вот первый пример: когда Вильгельм Шиккард в 1623 году изобретал арифмометр, он уже был UX/UI дизайнером."
                        },
                        {
                            "text": "Потому что именно он придумывал, какие тумблеры и в какой последовательности должен крутить человек, чтобы получить результат вычислений. И он же придумывал"
                        },
                        {
                            "text": "Ещё один более древний и примитивный пример — точильный камень (колесо). Уже даже в раннем средневековье было много разновидностей и механизмов такого колеса:",
                            "list": [
                                "его можно было крутить рукояткой вручную",
                                "колесо мог крутить другой человек",
                                "или его можно было раскручивать даже без рук, нажимая педаль ногой"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}